Consider the following Python dictionary `data` and Python list `labels`:

``` python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```

**1.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

In [132]:
import pandas as pd
import numpy as np
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
data['labels']=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, columns=['animal', 'age', 'visits', 'priority', 'labels'])
df.set_index('labels')

       animal  age  visits priority
labels
a         cat  2.5       1      yes
b         cat  3.0       3      yes
c       snake  0.5       2       no
d         dog  NaN       3      yes
e         dog  5.0       2       no
f         cat  2.0       3       no
g       snake  4.5       1       no
h         cat  NaN       1      yes
i         dog  7.0       2       no
j         dog  3.0       1       no

**2.** Display a summary of the basic information about this DataFrame and its data (*hint: there is a single method that can be called on the DataFrame*).

In [24]:
print("Summary of the basic information about this DataFrame and its data:")
print(df.info())

Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
 4   labels    10 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 528.0+ bytes
None

**3.** Return the first 3 rows of the DataFrame `df`.

In [25]:
df1 = df.head(3)
df1

  animal  age  visits priority labels
0    cat  2.5       1      yes      a
1    cat  3.0       3      yes      b
2  snake  0.5       2       no      c

**4.** Display the 'animal' and 'age' columns from the DataFrame `df`

In [26]:
df2=df[['animal','age']]
df2

  animal  age
0    cat  2.5
1    cat  3.0
2  snake  0.5
3    dog  NaN
4    dog  5.0
5    cat  2.0
6  snake  4.5
7    cat  NaN
8    dog  7.0
9    dog  3.0

**5.** Display the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']'

In [27]:
df3 = df.loc[[3, 4, 8],
             ['animal','age']]
df3

  animal  age
3    dog  NaN
4    dog  5.0
8    dog  7.0

**6.** Select only the rows where the number of visits is greater than 3.

In [28]:
print("the number of visits is greater than 3:")
print(df[df['visits'] > 3])

the number of visits is greater than 3:
Empty DataFrame
Columns: [animal, age, visits, priority, labels]
Index: []

**7.** Select the rows where the age is missing, i.e. it is `NaN`.

In [37]:
df4 = df[df['age'].isnull()]
df4

  animal  age  visits priority labels
3    dog  NaN       3      yes      d
7    cat  NaN       1      yes      h

**8.** Select the rows where the animal is a cat *and* the age is less than 3.

In [60]:
options =['cat']
df5= df.loc[(df['age'] < 3)&
        df['animal'].isin(options)]
df5

  animal  age  visits priority labels
0    cat  2.5       1      yes      a
5    cat  2.0       3       no      f

**9.** Select the rows where the age is between 2 and 4 (inclusive)

In [63]:
df6=df[df['age'].between(2, 4)]
df6

  animal  age  visits priority labels
0    cat  2.5       1      yes      a
1    cat  3.0       3      yes      b
5    cat  2.0       3       no      f
9    dog  3.0       1       no      j

**10.** Change the age in row 'f' to 1.5.

**11.** Calculate the sum of all visits in `df` (i.e. the total number of visits).

In [88]:
print(df['visits'].sum())

19

**12.** Calculate the mean age for each different animal in `df`.

In [110]:
df.groupby('animal').mean()

        age  visits
animal
cat     2.5     2.0
dog     5.0     2.0
snake   2.5     1.5

**13.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame.

In [107]:
df.loc['k'] = ['dog', 3, 2, 'yes',10]
print("Print all records after insert a new record:")
print(df)
print("\nDelete the new row and display the original  rows:")
df = df.drop('k')
print(df)

Print all records after insert a new record:
  animal  age  visits priority labels
0    cat  2.5       1      yes      a
1    cat  3.0       3      yes      b
2  snake  0.5       2       no      c
3    dog  NaN       3      yes      d
4    dog  5.0       2       no      e
5    cat  2.0       3       no      f
6  snake  4.5       1       no      g
7    cat  NaN       1      yes      h
8    dog  7.0       2       no      i
9    dog  3.0       1       no      j
k    dog    3       2      yes     10

Delete the new row and display the original  rows:
  animal  age  visits priority labels
0    cat  2.5       1      yes      a
1    cat  3.0       3      yes      b
2  snake  0.5       2       no      c
3    dog  NaN       3      yes      d
4    dog  5.0       2       no      e
5    cat  2.0       3       no      f
6  snake  4.5       1       no      g
7    cat  NaN       1      yes      h
8    dog  7.0       2       no      i
9    dog  3.0       1       no      j

**14.** Count the number of each type of animal in `df`.

In [115]:
df.groupby('animal').count()

        age  visits  priority  labels
animal
cat       3       4         4       4
dog       3       4         4       4
snake     2       2         2       2

**15.** Sort `df` first by the values in the 'age' in *decending* order, then by the value in the 'visits' column in *ascending* order (so row `i` should be first, and row `d` should be last).

In [126]:
df.sort_values( by="age"  
               ,ascending=False )
df.sort_values(by='visits'
              ,ascending=False)

  animal  age  visits priority labels
1    cat  3.0       3      yes      b
3    dog  NaN       3      yes      d
5    cat  2.0       3       no      f
2  snake  0.5       2       no      c
4    dog  5.0       2       no      e
8    dog  7.0       2       no      i
0    cat  2.5       1      yes      a
6  snake  4.5       1       no      g
7    cat  NaN       1      yes      h
9    dog  3.0       1       no      j

**16.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`.

In [133]:
df = df.replace({'priority': {'yes': True, 
                                'no': False}})
df

  animal  age  visits  priority labels
0    cat  2.5       1      True      a
1    cat  3.0       3      True      b
2  snake  0.5       2     False      c
3    dog  NaN       3      True      d
4    dog  5.0       2     False      e
5    cat  2.0       3     False      f
6  snake  4.5       1     False      g
7    cat  NaN       1      True      h
8    dog  7.0       2     False      i
9    dog  3.0       1     False      j

**17.** In the 'animal' column, change the 'snake' entries to 'python'.

In [146]:
print(df.rename('snake'= 'python'))

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (406017292.py, line 1)

**18.** Load the ny-flights dataset to Python

In [149]:
df = pd.read_csv(r'ny-flights.csv')
print(df)

                   fl_date unique_carrier  airline_id tail_num  fl_num origin  \
0      2014-01-01 00:00:00             AA       19805   N338AA       1    JFK
1      2014-01-01 00:00:00             AA       19805   N335AA       3    JFK
2      2014-01-01 00:00:00             AA       19805   N327AA      21    JFK
3      2014-01-01 00:00:00             AA       19805   N3EHAA      29    LGA
4      2014-01-01 00:00:00             AA       19805   N319AA     117    JFK
...                    ...            ...         ...      ...     ...    ...
20812  2014-01-31 00:00:00             UA       19977   N54711    1253    ROC
20813  2014-01-31 00:00:00             UA       19977   N77525    1429    LGA
20814  2014-01-31 00:00:00             UA       19977   N37293    1456    LGA
20815  2014-01-31 00:00:00             UA       19977   N24729    1457    LGA
20816  2014-01-31 00:00:00             MQ       20398   N609MQ    3699    BUF

      dest  dep_time  dep_delay  arr_time  arr_delay  cancelled  \
0      LAX     914.0       14.0    1238.0       13.0        0.0
1      LAX    1157.0       -3.0    1523.0       13.0        0.0
2      LAX    1902.0        2.0    2224.0        9.0        0.0
3      PBI     722.0       -8.0    1014.0      -26.0        0.0
4      LAX    1347.0        2.0    1706.0        1.0        0.0
...    ...       ...        ...       ...        ...        ...
20812  ORD     801.0       -4.0     908.0        4.0        0.0
20813  CLE    1522.0      -10.0    1649.0      -31.0        0.0
20814  IAH     719.0       -6.0    1006.0      -20.0        0.0
20815  IAH     852.0        7.0    1156.0       -6.0        0.0
20816  ORD    1208.0      -12.0    1251.0      -19.0        0.0

                       arr                  dep
0      2014-01-01 12:38:00  2014-01-01 09:14:00
1      2014-01-01 15:23:00  2014-01-01 11:57:00
2      2014-01-01 22:24:00  2014-01-01 19:02:00
3      2014-01-01 10:14:00  2014-01-01 07:22:00
4      2014-01-01 17:06:00  2014-01-01 13:47:00
...                    ...                  ...
20812  2014-01-31 09:08:00  2014-01-31 08:01:00
20813  2014-01-31 16:49:00  2014-01-31 15:22:00
20814  2014-01-31 10:06:00  2014-01-31 07:19:00
20815  2014-01-31 11:56:00  2014-01-31 08:52:00
20816  2014-01-31 12:51:00  2014-01-31 12:08:00

[20817 rows x 14 columns]

**19.** Which airline ID is present maximum times in the dataset

**20.** Draw a plot between dep_delay and arr_delay

In [150]:
import matplotlib.pyplot as plt
plt.subplot(dep_delay and arr_delay)

NameError: name 'dep_delay' is not defined